//#define _CRT_SECURE_NO_WARNINGS 1
//#include <string.h>
//操作符
//#include <stdio.h>
//int main()
//{
//	int a = 0;//4个字节，32个bit位
//	//00000000000000000000000000000000
//	int b = ~a;//b是有符号的整型
//	//11111111111111111111111111111111(补码形式）
//	//11111111111111111111111111111110（反码形式）
//	//10000000000000000000000000000001（原码，符号位不变）
//	//负数在内存中存储的时候，存储的是二进制的补码
//	printf("%d\n", b);//使用的是这个数的原码
//	return 0;
//}
//移位操作符 >>  <<
//位操作符 & ^ |
//单目操作符
//int main()
//{
//	int arr[10] = { 0 };
//	int sz = 0;
//	printf("%d\n", sizeof(arr));//10 * 4 =40个字节，计算数组的总大小，也就是所占总内存
//	//计算数组的元素个数，数组总大小/每个元素的大小
//	sz = sizeof(arr) / sizeof(arr[0]);
//	printf("sz = %d", sz);
//	return 0;
//	//int a = 10;
//	//printf("%d", sizeof(a));//计算的变量/类型所占空间的大小，单位是字节
//	//printf("%d", sizeof(int));//第二种写法，算a所占空间大小
//	//printf("%d", sizeof a);//在形容变量时括号可以省略，在形容类型时，括号不可以省略
//
//	//int a = -2;
//	//int b = -a;
//	//int c = +3;//+号都会省略
//	//return 0;
////}

